app/views/shared/_side_bar.html.haml

SELECT `groups`.* FROM `groups` INNER JOIN `group_users` ON `groups`.`id` = `group_users`.`group_id` WHERE `group_users`.`user_id` = 1
---
  .side-bar__group
    - current_user.groups.each do |group|
      .side-bar__group__box