app/controllers/groups_controller.rb

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
UPDATE `groups` SET `name` = 'グループ編集テスト', `updated_at` = '2020-01-27 08:39:26' WHERE `groups`.`id` = 1
---
  def update
    @group = Group.find(params[:id])
    if @group.update(group_params)