app/controllers/messages_controller.rb

SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 1 ORDER BY `messages`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 1
---
  def index
    @message = Message.new
    @messages = @group.messages.includes(:user)

INSERT INTO `messages` (`content`, `image`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('', 'iOS_の画像.png', 1, 1, '2020-01-29 01:46:50', '2020-01-29 01:46:50')
---
  def create
    @message = @group.messages.new(message_params)
    if @message.save